import React from "react";

import { PolicyContainer, Title, Description } from "./Policy.styles";

const PolicyPage = () => {
  return (
    <PolicyContainer>
      <Title>قوانین ما</Title>
      <Description>
        کاربر گرامی؛ ضمن سپاس از انتخاب سرویس فیلیمو لازم است پیش از خرید مورد
        نظر و تماشای فیلم، سریال و تئاتر، توافقنامه و قوانین ذیل را مطالعه
        فرمایید، فیلیمو سرویس خود را تحت شرایط و مقررات این توافقنامه در اختیار
        شما می گذارد و شما به عنوان کاربران این سرویس ملزم به رعایت مفاد مذکور
        در این توافقنامه که ممکن است در آینده تغییر یابد، هستید. این سرویس با
        نام تجاری "فیلیمو" ثبت گردیده است و از حق کپی رایت برخوردار است. اگر در
        سایت های دیگر با موارد نقض کپی رایت فیلیمو مواجه شدید، لطفا آن را به
        سرویس پشتیبانی « فیلیمو» به آدرس ایمیل support [at] filimo [dot] com زیر
        اطلاع دهید. تمامی محتواهای ارایه شده در سرویس فیلیمو در چارچوب قوانین و
        مقررات جمهوری اسلامی ایران می باشد. برای دسترسی به نمایش محتوای مورد
        نظر، کاربر باید اقدام به خرید اشتراک نماید. خرید اشتراک در واقع به منزله
        خرید دسترسی به محتواهای فیلیمو می باشد. فیلیمو در صورت مشاهده هرگونه
        اقدام غیر متعارف برای دسترسی به اشتراک، خرید و ورود، این حق را دارد که
        این اقدامات غیرمجاز را متوقف و در ادامه اشتراک کاربر را لغو کند. تعداد
        محتواهایی که کاربران با خرید اشتراک به آنها دسترسی پیدا می کنند ممکن است
        پیش از پایان مدت اعتبار اشتراک، تغییر یافته و فیلم ها یا سریال هایی به
        مجموع محتواها اضافه یا از آن حذف گردد. همچنین ممکن است با تغییر مکان
        جغرافیایی خود به سایر کشورها، دسترسی به تعدادی از محتواها که اجازه نشر
        در خارج از کشور ندارند را از دست بدهید.
      </Description>
    </PolicyContainer>
  );
};

export { PolicyPage };
